Конфигурация/Documents/ВводОстатковАктивовСтраховыхКомпаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВводОстатковАктивовСтраховыхКомпаний</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиПрочихАктивов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеОперации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящийДокумент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязаннаяКорректировка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьНачальныеОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОстаткиДенежныхСредствНаРасчетныхСчетах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Брокер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВходящийОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПрочие</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОстаткиПрочихАктивов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПрочегоАктива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Актив</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубъектПрочегоАктива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВходящийОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрочиеСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ВводОстатковАктивовСтраховыхКомпаний/Ext/ManagerModule.bsl
// Создает документ "Ввод активов страховой компании", связанный с документом "Корректировка регистров" 
//
//  Параметры
//  документ - Документ "Корректировка регистров"

Процедура СоздатьДокументДляСуществующейКорректировкиРегистров(ДокументКорректировкаРегистров)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводОстатковАктивовСтраховыхКомпаний.Ссылка КАК Документ
		|ИЗ
		|	Документ.ВводОстатковАктивовСтраховыхКомпаний КАК ВводОстатковАктивовСтраховыхКомпаний
		|ГДЕ
		|	ВводОстатковАктивовСтраховыхКомпаний.СвязаннаяКорректировка = &СвязаннаяКорректировка";
	
	Запрос.УстановитьПараметр("СвязаннаяКорректировка", ДокументКорректировкаРегистров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		  // Создан документ для корректировки, новый не должен быть создан
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранный документ ""Корректировка регистров"" уже используетсяв качестве связанной корректировки в существующем документе ""Ввод остатков активов страховых компаний",
			ВыборкаДетальныеЗаписи.Документ);
		Возврат;
	КонецЦикла;
	
	НовыйДокумент = Документы.ВводОстатковАктивовСтраховыхКомпаний.СоздатьДокумент();
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(НовыйДокумент);

	
	//ДокументКорректировкаРегистров = Документы.КорректировкаРегистров.ПустаяСсылка();

	НовыйДокумент.Организация = ДокументКорректировкаРегистров.Организация;
	НовыйДокумент.СчетДоверительногоУправления = ДокументКорректировкаРегистров.СчетДоверительногоУправления;
	НовыйДокумент.СвязаннаяКорректировка = ДокументКорректировкаРегистров.Ссылка;
	
	НовыйДокумент.ЗагрузитьСвязаннуюКорректировкуРегистровНаСервереДенежныеСредства();
	НовыйДокумент.ЗагрузитьСвязаннуюКорректировкуРегистровНаСервереПрочиеАктивы();
	
	НовыйДокумент.Дата = ДокументКорректировкаРегистров.Дата;
	
	Для каждого ПрочийАктив из  НовыйДокумент.ОстаткиПрочихАктивов цикл
		     ПрочийАктив.УчетныйАктивЕПС = ОпределитьУчетныйПрочийАктивЕПС(НовыйДокумент.Дата, , ПрочийАктив.Актив);
	конеццикла;
	
	НовыйДокумент.Записать( РежимЗаписиДокумента.Проведение);
	 	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранный документ ""Корректировка регистров"" успешно импортирован в новый документ ""Ввод остатков активов страховых компаний",
			НовыйДокумент);

КонецПроцедуры

Функция ОпределитьУчетныйПрочийАктивЕПС(Период, Рынок, ПрочийАктив) Экспорт

	Если ПрочийАктив.ВидПрочегоАктива = Справочники.ВидыПрочихАктивов.ДолиПерестраховщиков Тогда
		
		//251. Доля перестраховщиков в страховых резервах по страхованию иному, чем страхование жизни	000000445
		//250. Доля перестраховщиков в страховых резервах по страхованию иному, чем страхование жизни	000000082
		Если  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000445") Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДоляПерестраховщиковВСтраховыхРезервахПоСтрахованиюИномуЧемСтрахованиеЖизни; 		
		ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000082") Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДоляПерестраховщиковВСтраховыхРезервахПоСтрахованиюИномуЧемСтрахованиеЖизни;

		// 255. Доля перестраховщиков в резерве заявленных, но неурегулированных убытков (из 250 строки)	000000091	
		ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000091") Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДоляПерестраховщиковВРезервеЗаявленныхУбытков;

			
		// 240. Доля перестраховщиков в страховых резервах по страхованию жизни	000000099	
		ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000099") Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДоляПерестраховщиковВСтраховыхРезервахПоСтрахованиюЖизни;

		КонецЕсли;    	
	ИначеЕсли ПрочийАктив.ВидПрочегоАктива = Справочники.ВидыПрочихАктивов.НедвижимоеИмущество Тогда
		Возврат Справочники.УчетныеАктивыЕПС.ОсновныеСредстваКромеЗемли;
	ИначеЕсли ПрочийАктив.ВидПрочегоАктива = Справочники.ВидыПрочихАктивов.Кассы Тогда
		Возврат Справочники.УчетныеАктивыЕПС.НаличныеВКассе;
	ИначеЕсли ПрочийАктив.ВидПрочегоАктива = Справочники.ВидыПрочихАктивов.ЗаймыПредоставленныеДругимОрганизациям Тогда
		Возврат Справочники.УчетныеАктивыЕПС.ПредоставленныеЗаймы;
	Иначе 
			///Задолженность контрагентов перед страховщиком по договорам репо       000000456
		 Если ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000456") Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ЗадолженностьКонтрагентовПередСтраховщикомПоДоговорамРепо; 	
		
		     //220. Дебиторская задолженность страховщиков по прямому возмещению убытков	000000373
		 ИначеЕсли ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000373") Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДебиторскаяЗадолженностьСтраховщиковПоПрямомуВозмещениюУбытков; 
			 
			 //201. ДЗ по операциям страхования, сострахования (Страхователи) (из строки 200)	000000368
		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000368") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.НепросроченнаяДебиторскаяЗадолженностьПоОперациямСтрахованияСострахованияСтрахователей;

			 //203. ДЗ по операциям страхования, сострахования (Страховые агенты)  (из строки 200)	000000369			 
		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000369") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.НепросроченнаяДебиторскаяЗадолженностьПоОперациямСтрахованияСострахованияСтраховыхАгентов;

			 //142. Займы, предоставленные другим организациям	000000366			 
		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000366") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.ПредоставленныеЗаймы;
			 
			 //230. Прочая дебиторская задолженность	000000081			 
		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000081") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.НепросроченнаяДебиторскаяЗадолженностьФизИЮрЛиц;
			 
			 //310. Основные средства, кроме недвижимого имущества	000000087			 
		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000087") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.ОсновныеСредстваКромеЗемли;
			 
			 // земли нет
			 //330. Нематериальные активы	000000090			 
		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000090") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.НематериальныеАктивы;
			 
			 //280. Запасы	000000083			 
		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000083") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.Запасы;
			 
			 // земли нет
			 // инвест имущества нет
			 // 290. Отложенные налоговые активы	000000002			 
		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000002") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.ОтложенныеНалоговыеАктивыПоВычитаемымВременнымРазницам;
			 
			 // 200. Дебиторская задолженность по операциям страхования	000000080
		 ИначеЕсли ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000080") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.ДебиторскаяЗадолженностьПоОперациямСтрахования;
			 
			// 210. Дебиторская задолженность по операциям перестрахования	000000372
		 ИначеЕсли ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000372") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.ДебиторскаяЗадолженностьПоОперациямПерестрахования;
			 
			 //231. Непросроченная дебиторская задолженность юридических и физических лиц (в том числе ИП)	000000429
		 ИначеЕсли ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000429") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.НепросроченнаяДебиторскаяЗадолженностьФизИЮрЛиц;
			 
			 // 232. Дебиторская Задолженность по налогам и сборам
		 ИначеЕсли ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000431") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.ДебиторскаяЗадолженностьПоНалогамИСборам;
					 // 233. Дебиторская Задолженность по причитающемуся к получению процентному и др. доходу
		 ИначеЕсли ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000432") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.ДебиторскаяЗадолженностьПоНалогамИСборам;
	 
			 // 231.1.  Денежные средства у брокера	000000430		 
		 ИначеЕсли ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000430") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.ДенежныеСредстваУБрокера;

			 // 331. Програмное обеспечение и базы данных (из 330 строки)     000000434   
		 ИначеЕсли ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000434") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.ПрограммноеОбеспечениеИБазыДанных;
			// 333. Отложенные аквизиционные расходы 000000457
		 ИначеЕсли ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000457") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.ОтложенныеАквизиционныеРасходы;
			//     332. Вложения в интеллектуальную собственность (из 330 строки) 000000392
		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000392") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.ВложенияВИнтеллектуальнуюСобственность;
			 
		 	//   210.2 Непросроченная дебиторская задолженность по операциям перестрахования (нерезиденты)  000000461
		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000461") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.НепросроченнаяДебиторскаяЗадолженностьПоОперациямПерестрахованияНерезидентов;	
			 
		 	//   200.1. Иная дебиторская задолженность по операциям страхования 000000415
		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000415") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.ИнаяДебиторскаяЗадолженностьПоОперациямСтрахования;		
			 
		 	//   202. ДЗ страхователей по дог-ам ОГС и дог-ам, заключ. впорядке 44, 223, 260 ФЗ (из 200 строки)   000000416
		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000416") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.ДебиторскаяЗадолженностьПоДоговорамОГС;	
			 
		 	//  150. Вклады в уставные (складочные) капиталы   000000367
		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000367") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.ВкладыВУставныеКапиталы;	
			 
			 	 
		 	//  200.2 Непросроченая дебиторская задолженность по операциям страхования, состахования (нерезиденты)   000000462

		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000462") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.НепросроченнаяДебиторскаяЗадолженностьПоОперациямСтрахованияСострахованияНерезидентов;	
			  
		 	 
		 	//  231.2 Непросроченная дебиторская задолженность юр. и физ лиц (РЕЗИДЕНТЫ) - связанные стороны   000000458

		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000458") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.НепросроченнаяДебиторскаяЗадолженностьСвязанныхСторон;
			  
	 
		 	//  231.3 Непросроченная дебиторская задолженность юр. и физ лиц (НЕРЕЗИДЕНТЫ)   000000459

		 ИначеЕсли  ПрочийАктив = Справочники.ПрочиеАктивы.НайтиПоКоду("000000459") Тогда
			 Возврат Справочники.УчетныеАктивыЕПС.НепросроченнаяДебиторскаяЗадолженностьСвязанныхСторон;
			 
		 Иначе
			 // Все остальные прочие активы
			 Возврат Справочники.УчетныеАктивыЕПС.ПрочиеАктивыВнеКлассификации;
		КонецЕсли;
			 // нет
			 
	КонецЕсли;
	
КонецФункции
